Revit 2026 API

# MEPSectionFixtureUnit Property

---

The fixture unit of the section.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double FixtureUnit { get; }
```
```vb
Public ReadOnly Property FixtureUnit As Double
	Get
```
```cpp
public:
property double FixtureUnit {
	double get ();
}
```
```fsharp
member FixtureUnit : float with get
```

#### Property Value

Double

In one section, all section members have same fixture unit. Fixture Unit is a number. The unit type is UT_Number.

#### Reference

MEPSection Class

Autodesk.Revit.DB.Mechanical Namespace